Revit 2024 API
SolidUtils.SplitVolumes Method
 Splits a solid geometry into several separate solids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static IList<Solid> SplitVolumes(
	Solid solid
)
Visual Basic
Public Shared Function SplitVolumes ( _
	solid As Solid _
) As IList(Of Solid)
Visual C++
public:
static IList<Solid^>^ SplitVolumes(
	Solid^ solid
)
Parameters
solid
Type: Autodesk.Revit.DB.Solid
 The solid.
Return Value
 The split solid geometries.
Remarks
 If no splitting is done, a copy of the input solid will be returned in the output array.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Failed to split the solid geometry.
See Also
SolidUtils Class
Autodesk.Revit.DB Namespace